"""7. Одиниці маси пронумеровані в такий спосіб: 1 - кілограм, 2 - міліграм, 3 - грам, 4 - тонна, 5 -
центнер. Дано номер одиниці маси (ціле число в діапазоні 1-5) і маса тіла в цих одиницях (дійсне
число). Знайти масу тіла в кілограмах."""


x= float(input())
y= float(input())

def mass(a, b) -> float:
    match a:
        case 1:
            return b
        case 2:
            return b/1000000
        case 3:
            return b/1000
        case 4:
            return b*1000
        case 5:
            return b*100

print(mass(x,y))